[
  {
    "path": "posts/2020-12-26-how-to-create-a-blog-or-a-website-in-r-with-distill-package/",
    "title": "How to create a blog or a website in R with {distill} package (in progress!)",
    "description": "If you're not online, you don't exist. A personal webpage or a blog became the business card of the digital century. It shows who you are and what you are capable of. Thus: show, don't tell.",
    "author": [
      {
        "name": "Yury Zablotski",
        "url": "https://yury-zablotski.netlify.app/"
      }
    ],
    "date": "2020-12-26",
    "categories": [
      "R & the Web",
      "videos"
    ],
    "contents": "\n\nContents\nWhy should we use distill?\nManual intermittent publishing (deploying)1. Install distill package\n2. Create your blog either manually with RStudio or with one line of code2.1. with RStudio\n2.2. with one line of code\n\n3. Build your website\n4. Publish your website via Netlify\n5. Create a new blog-post\n\nAutomated continuous publishing (deploying)1. Install distill and usethis packages\n2. Create your blog either manually with RStudio or with one line of code2.1. with RStudio\n2.2. with one line of code\n\n3. Build your website\n4. Connect to your githubStage and Commit\nRun use_github() to create a new Github repository\n\nPublish your blog with Netlify\nCreate a new blog-post\nAlways Knit after changing\n\nBlog configuration with \"_site.yml\"\nImprove your website or blog\nTheming - change desing and appearence of your blog\nDifference between a website and a blog\nUseful ressources\n\nWhy should we use distill?\nBecause it’s an easy, quick and free way to go online today. All you need to create a website or a blog is R, RStudio and Netlify account. Moreover, it requires very little programming. It might not look too fancy in the beginning (though totally enough for me), but with some effort you’ll be able to re-design your website as you wish. Besides, distill was originally aimed to make scientific online-publishing easier, so, it can’t be too bad ;). By the way, The blog you reading right now was created with distill. How? That’s what this article is all about.\nIf you don’t have or don’t want to have a Github account (and continuous deployment), just read on. But if you are comfortable with Github and wanna continuously deploy via Github, jump to the chapter “Automated continuous publishing (deploying)”.\nManual intermittent publishing (deploying)\nWhy should we even consider manual instead of automated? Well, for some non-programmers going with the continuous deployment via Github immediately might be very challenging and frustrating. I’ve been there. We all know what is “better” and “more time effective” in the long run, but the complexity might sometimes turn us off from doing something we would love to, resulting into “it’s just not my cup of tea” attitude. Other do not even need the continuous deployment, because they publish rarely, e.g. once per month, but would still like to be online. Going to the WordPress and co., which would most likely screw either code or code-output, is not always a solution. Fortunately, distill and Netlify greatly reduce the complexity of going online. Thus, have a look at the video and then follow the step by step procedure described below and you’ll be online with your blog in minutes.\n1. Install distill package\n\n\ninstall.packages(\"distill\")\n\n\n\n2. Create your blog either manually with RStudio or with one line of code\n2.1. with RStudio\nopen RStudio\nFile => New Project… => New Directory => Distill Blog\n“Directory name” will be the name of the folder, where all the documents from your blog will be stored\nChoose the directory where this folder supposed to be stored\nGive your blog a name. You’ll be able to rename it later\nClick “Create project”\n2.2. with one line of code\n\n\ndistill::create_blog(dir = \"my blog\", title = \"A cool name of my blog\")\n\n\n\n3. Build your website\nA new RStudio window with newly created files and folders (right left corner) will open itself. One of the folders \"_posts\" will contain all your posts. There are already some examples of it. But don’t bother about it now.\nFind the “Build” tab and press “Build Website”. You’ll see the process of building.\nClick “Open in Browser” and explore your website\nWe aren’t online yet. But very soon!\n4. Publish your website via Netlify\ngo the https://www.netlify.com/, sing up for Netlify (I used the Email way) and confirm your Email.\nIn Netlify you’ll see a window with: “Want to deploy a new site without connecting to Git? Drag and drop your site folder here”. If you somehow don’t see it, find and press “Team overview”.\ngo to the directory of your blog and find the \"_site\" folder\ndrag and drop the \"_site\" folder from your computed into this window\nwait a moment till the “Production” tab produces green colored “Published” and you’ll get a funny named website in the left top corner, also green and starting with “https://”. My was “https://condescending-darwin-bc567f.netlify.app” :)\nclick on it\nCongrats, you are online!\nGo to “Site settings” => “Change site name”\nrename your site (e.g. better-name) and hit “Save”\nClick on the “better-name.netlify.app” to make sure the name has changed and the site is still working\ngo back to RStudio to populate your blog\n5. Create a new blog-post\nrun the line below with the name of your choice\n\n\ndistill::create_post(\"My second blog post...this one will be really good :-)\")\n\n\n\na new partly pre-filled Rmarkdown document will open itself in RStudio\nfill it with some text and code as you usually do with Rmarkdown documents\nhit “Knit”. NOTE: you’ll need to always “Knit” all blog-posts individually. “Build Website” would not render them for you. However, the distill-Website (we are doing Blog now) would. You can learn more about the difference between them here.\nthis new post exists only on your local computer, still not online, thus…\ngo back to Netlify and click “Deploys” tab, where you’ll see another window with: “Need to update your site? Drag and drop your site folder here”\ndrag and drop the \"_site\" folder there and wait till “Production” tab produces green “Published”\nclick on the “better-name.netlify.app” to make sure the new blog-post appeared\nclick on your post and enjoy your creative work for a moment ;), then\ngo back to RStudio and repeat step 5\nAutomated continuous publishing (deploying)\nContinuous deployment is cool! But the path there can be a little prickly. This path may take a couple of hours or days (in my case 🙈). But, once there, you quickly forget all the troubles and using Github with continuous deployment becomes your second nature. So, I think there are many people which deploy either still manually or already continuously. But not many of them in the middle (I might be wrong though). Thus, I will assume you already have installed Git on your computer, created a Github account and connected your RStudio to your Github. If not, but you wanna be there, I could recommend a single short free online book which helped me go through it: Happy Git and GitHub for the useR.\n1. Install distill and usethis packages\n\n\ninstall.packages(\"distill\")\ninstall.packages(\"usethis\")\n\n\n\n2. Create your blog either manually with RStudio or with one line of code\n2.1. with RStudio\nopen RStudio\nFile => New Project… => New Directory => Distill Blog\n“Directory name” will be the name of the folder, where all the documents from your blog will be stored\nChoose the directory where this folder supposed to be stored\nGive your blog a name. You’ll be able to rename it later\nClick “Create project”\n2.2. with one line of code\n\n\ndistill::create_blog(dir = \"my blog\", title = \"A cool name of my blog\")\n\n\n\n3. Build your website\nA new RStudio window with newly created files and folders (right left corner) will open itself. One of the folders \"_posts\" will contain all your posts. There are already some examples of it. But don’t bother about it now.\nFind the “Build” tab and press “Build Website”. You’ll see the process of building.\nClick “Open in Browser” and explore your website\nWe aren’t online yet. But very soon!\n4. Connect to your github\nRun use_git() and answer two questions:\n“Is it ok to commit them?” Don’t commit by typing 3 for “No”, or “Nope” or similar.\n“A restart of RStudio is required to activate the Git pane Restart now?” Restart by typing 2 for “Yes” or “Yup”.\n\n\n\nusethis::use_git() \n\n\n\nAfter restart you’ll see a “Git” tab near the Environment, History etc. That’s gut! ;) Click on the “Git” tab and you’ll see Empty boxed under “Staged”, lot’s of yellow question marks under “Status” and the documents names under “Path”.\nStage and Commit\nCheck all the boxes and press “Commit” button, which is between the “Status” and “History” tabs. A colorful window will pop up. This window will describe all the changes you are about to make to your blog.\nDefinitely describe what you have done for a future you, because then you’ll always be able to get back to this, in case something stops working. That’s what they call - a version control.\nWrite something like “first commit” and press “Commit”.\nClose or forget the window and go back to RStudio.\nRun use_github() to create a new Github repository\n\n\nusethis::use_github() \n\n\n\nA new repository will be automatically created on your Github profile and the new browser window with your Github will pop up.\nIf you’ll be asked: “Which git protocol to use?”, choose the one with “https” and if you’ll then be asked: “Are title and description ok?”, agree with “Yes” or “Ok” or similar.\nNOTE: if something else doesn’t work, get back to the “Happy Git” book and work through it. You’ll only need it once. Three main things you’d need to get working are:\ninstall git\nconnect RStudio to your Github and\nconfigure a Github Personal Access Token\nPublish your blog with Netlify\nIf you have a Netlify account you are fine, if not you can create one using your Github account. Then press:\n“New site from Git” in a green box\nClick on Configure Netlify on “Github”,\nChoose a newly created repository, you’ll recognize the name (“my blog”?).\nNOTE: Make sure to set the “Publish Directory” to \"_site\" (could be “docs” if you checked some boxes while creating new project)\nClick deploy!\nyou’ll get an absurd or funny random name for your website (e.g. gracious-mestorf-194a9f), which you immediately by\nclicking “Site settings” => “Change site name”\nnow go on and click on the link of your blog. Congrats! Your blog is online! ;)\ngo back to RStudio and create a new post\nCreate a new blog-post\nrun following command in the Console:\n\n\ncreate_post(\"My second blog post...this will be really good :-)\")\n\n\n\na new RMarkdown document will be created and opened.\nthese new post is only on your local computer, but still not online, thus,\n“Knit” the document\ngo to the “Git” tab and check all the boxes\npress “Commit”\nadd some description\nagain press “Commit”\nwait until you see the “Close” button and close “Git commit” pop up window\npress “Push”\nwait until you see the “Close” button and close “Git push” pop up window\nclose or ignore the other pop up window.\nGet back to your Webpage and refresh (it may take a few seconds, so, don’t panic if the first refresh don’t work). You should see a new blog-post.\nNow you can repeat following routine for every post: - Create or change posts - Knit - Commit - Push\nCongrats! You are continuosly deploy your online blog.\nAlways Knit after changing\nBy the way, if you don’t want your post to publish until you really sure, you can start out as a draft:\n\n\ndistill::create_post(\"Another nice post\", draft = TRUE)\n\n\n\n“Knitting” blog posts is the only way to update it. They are not re-rendered when the site is built, because it’s computationally expensive and prone to problems. Build Website would not work for blogs.\nBlog configuration with \"_site.yml\"\nOpen \"_site.yml\". You’ll see something like that:\n\nname: \"reproducible-finance-with-r\"\ntitle: \"Reproducible Finance with R\"\ndescription: |\n  Exploring reproducible finance with the R statistical \n  computing environment.\nbase_url: https://beta.rstudioconnect.com/content/11424/\nnavbar:\n  logo: images/rstudio.png\n  right:\n    - text: \"Home\"\n      href: index.html\n    - text: \"About\"\n      href: about.html\n    - text: \"Contributors\"\n      href: contributors.html\n    - icon: fa fa-rss\n      href: index.xml\noutput: distill::distill_article\n\nImprove your website or blog\nListing pages\nCategories\nCategories can be added similar to the blogdown in the\n\ntitle: \"How to create a blog or a website in R with {distill} package (in progress!)\"\nauthor:\n  - name: Yury Zablotski\ndate: 12-26-2020\ncategories:\n  - R & the Web\n  - videos\n\nThumbnails\nThumbnails (or previews) are the images which are displayed along the post. They serve as an eyecatcher. You can add a preview image into the post’s metadata by adding a “preview” field:\n\ntitle: \"Blog post on how to write blog posts\"\ndescription: |\n  Here we were out of ideas, and therefore we are proud to announce\nour new post about how to write a post. Creativity is a b**ch! ... And I love her!\npreview: images/photo-of-me-because-I-am-sooo-beautifuuulll-toniiiight.png\n\nTheming - change desing and appearence of your blog\nDistill blogs can use themes and CSS just like Distill sites. You can use the create_theme() function to add a theme CSS file in the current working directory:\ncreate_theme(name = “theme”)\n\n\ndistill::create_theme(name = \"theme\") \n\n\n\nTo apply a custom theme site-wide, add a theme key to the top-level of your \"_site.yml\" configuration file:\n\n\nname: \"distill\"\ntitle: \"Distill for R Markdown\"\ntheme: theme.css \n\n\n\nDifference between a website and a blog\nAll articles on a website are re-rendered when the site is rebuilt while the blog-post are not. We need to knit each of the article separately. This might sound bad first, because we are not uptodate with our blog, but I personally found it great. See, like the authors of “distill” state: “Given that R package upgrades have a tendency to break older code, continuously re-rendering old posts is nearly impossible to do without errors, especially over longer periods of time.” That happend to my old blogdown-generated website, where Hugo-Academic theme changes so dramatically that I could not modify my site anymore, and, since it was not on Github, I could not even ask R community, what is wrong. Thus, I totally understand, if you go for a manual deployment first (been there!), but I would recommend you to progress to Github and continuous deploy after you have got comfortable. Especially if you create a lot, automated deployment will save you lot’s of time. However, my old blogdown-website is still online and running. Thus, I prefer blog instead of the website.\nUseful ressources\nTom Mocks blog-post on how to build blogs with distill: https://themockup.blog/posts/2020-08-01-building-a-blog-with-distill/\nLearn more about using Distill at https://rstudio.github.io/distill.\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-27T18:32:34+01:00",
    "input_file": "how-to-create-a-blog-or-a-website-in-r-with-distill-package.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to yuzaR-Blog",
    "description": "Welcome to our new blog, yuzaR-Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-26",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-26T21:02:21+01:00",
    "input_file": {}
  }
]
